pmo-dataset/variations/mermaid_basic/40.mmd
graph LR
	ParallelGateway_1{"+"} --> Task_4["Get quality data"]
	ParallelGateway_1 --> Task_3["Get availability data"]
	ParallelGateway_1 --> Task_5["Get performance data"]
	Task_4 --> ParallelGateway_2{"+"}
	Task_3 --> ParallelGateway_2
	Task_5 --> ParallelGateway_2
	ParallelGateway_2 --> Task_6["Calculate OEE"]
	ExclusiveGateway_1{"OEE below 50%?"} -->|"Yes"| Task_1["Stop the machine"]
	Task_1 --> Task_2["Send email to an engineer"]
	StartEvent_1(("OEE data required")) --> ParallelGateway_1
	Task_2 --> ExclusiveGateway_3{"Machine worth repairing?"}
	Task_8["Repair the issue"] --> ExclusiveGateway_5{"Remaining issues?"}
	Task_9["Restart the machine"] --> Task_7["Continue measuring"]
	ExclusiveGateway_2{"X"} --> EndEvent_1(("Machine operating normally / Machine disconnected"))
	Task_6 --> ExclusiveGateway_1
	ExclusiveGateway_3 -->|"No"| Task_10["Disconnect the machine"]
	ExclusiveGateway_4{"X"} --> ExclusiveGateway_2
	Task_10 --> ExclusiveGateway_4
	Task_7 --> ExclusiveGateway_4
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_6{"X"}
	ExclusiveGateway_5 -->|"No"| Task_9
	ExclusiveGateway_6 --> Task_8
	ExclusiveGateway_5 -->|"Yes"| ExclusiveGateway_6
	ExclusiveGateway_1 -->|"No"| ExclusiveGateway_2
